---
kind: property
id: P:Autodesk.Revit.DB.Events.ElementTypeDuplicatedEventArgs.NewElementTypeId
source: html/31163df2-d06e-cef6-9830-2b2702a88047.htm
---
# Autodesk.Revit.DB.Events.ElementTypeDuplicatedEventArgs.NewElementTypeId Property

The id of the newly duplicated ElementType.

## Syntax (C#)
```csharp
public ElementId NewElementTypeId { get; }
```